In [1]:
import pandas as pd

In [2]:
listings = pd.read_csv('../data/london_listings.csv')

In [3]:
df_clean = listings[['id', 'price', 'host_is_superhost', 'neighbourhood_cleansed', 'property_type', 'room_type', 'accommodates', 'bathrooms_text', 'bedrooms', 'beds', 'instant_bookable', 'host_has_profile_pic', 'host_identity_verified', 'number_of_reviews']]

In [4]:
df_clean

,id,price,host_is_superhost,neighbourhood_cleansed,property_type,room_type,accommodates,bathrooms_text,bedrooms,beds,instant_bookable,host_has_profile_pic,host_identity_verified,number_of_reviews
0,11551,$97.00,f,Lambeth,Entire apartment,Entire home/apt,4,1 bath,1.0,3.0,t,t,t,192
1,13913,$40.00,f,Islington,Private room in apartment,Private room,2,1 shared bath,1.0,0.0,f,t,t,21
2,15400,$75.00,f,Kensington and Chelsea,Entire apartment,Entire home/apt,2,1 bath,1.0,1.0,t,t,t,89
3,17402,$307.00,t,Westminster,Entire apartment,Entire home/apt,6,2 baths,3.0,3.0,f,t,t,42
4,17506,$150.00,f,Hammersmith and Fulham,Private room in bed and breakfast,Private room,2,1 private bath,1.0,1.0,f,t,t,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
76979,46259322,$90.00,t,Westminster,Entire apartment,Entire home/apt,2,1 bath,1.0,1.0,f,t,t,0
76980,46259459,$87.00,f,Westminster,Private room in apartment,Private room,2,2 shared baths,1.0,2.0,t,t,f,0
76981,46259503,$26.00,f,Redbridge,Private room in house,Private room,2,1.5 shared baths,1.0,1.0,t,t,t,0
76982,46259530,$59.00,f,Hammersmith and Fulham,Private room in apartment,Private room,2,1 private bath,1.0,NaN,f,t,t,0
76983,46261520,$44.00,f,Haringey,Private room in apartment,Private room,1,NaN,1.0,1.0,t,t,t,0

In [5]:
#reset index to listing id
df_clean = df_clean.set_index('id')
df_clean

,price,host_is_superhost,neighbourhood_cleansed,property_type,room_type,accommodates,bathrooms_text,bedrooms,beds,instant_bookable,host_has_profile_pic,host_identity_verified,number_of_reviews
id,,,,,,,,,,,,,
11551,$97.00,f,Lambeth,Entire apartment,Entire home/apt,4,1 bath,1.0,3.0,t,t,t,192
13913,$40.00,f,Islington,Private room in apartment,Private room,2,1 shared bath,1.0,0.0,f,t,t,21
15400,$75.00,f,Kensington and Chelsea,Entire apartment,Entire home/apt,2,1 bath,1.0,1.0,t,t,t,89
17402,$307.00,t,Westminster,Entire apartment,Entire home/apt,6,2 baths,3.0,3.0,f,t,t,42
17506,$150.00,f,Hammersmith and Fulham,Private room in bed and breakfast,Private room,2,1 private bath,1.0,1.0,f,t,t,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
46259322,$90.00,t,Westminster,Entire apartment,Entire home/apt,2,1 bath,1.0,1.0,f,t,t,0
46259459,$87.00,f,Westminster,Private room in apartment,Private room,2,2 shared baths,1.0,2.0,t,t,f,0
46259503,$26.00,f,Redbridge,Private room in house,Private room,2,1.5 shared baths,1.0,1.0,t,t,t,0
46259530,$59.00,f,Hammersmith and Fulham,Private room in apartment,Private room,2,1 private bath,1.0,NaN,f,t,t,0
46261520,$44.00,f,Haringey,Private room in apartment,Private room,1,NaN,1.0,1.0,t,t,t,0

In [6]:
#make price a float
df_clean['price'] = df_clean['price'].str.replace(',', '')
df_clean['price'] = df_clean['price'].str.replace('$', '')
df_clean['price'] = df_clean['price'].astype(float)
df_clean

,price,host_is_superhost,neighbourhood_cleansed,property_type,room_type,accommodates,bathrooms_text,bedrooms,beds,instant_bookable,host_has_profile_pic,host_identity_verified,number_of_reviews
id,,,,,,,,,,,,,
11551,97.0,f,Lambeth,Entire apartment,Entire home/apt,4,1 bath,1.0,3.0,t,t,t,192
13913,40.0,f,Islington,Private room in apartment,Private room,2,1 shared bath,1.0,0.0,f,t,t,21
15400,75.0,f,Kensington and Chelsea,Entire apartment,Entire home/apt,2,1 bath,1.0,1.0,t,t,t,89
17402,307.0,t,Westminster,Entire apartment,Entire home/apt,6,2 baths,3.0,3.0,f,t,t,42
17506,150.0,f,Hammersmith and Fulham,Private room in bed and breakfast,Private room,2,1 private bath,1.0,1.0,f,t,t,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
46259322,90.0,t,Westminster,Entire apartment,Entire home/apt,2,1 bath,1.0,1.0,f,t,t,0
46259459,87.0,f,Westminster,Private room in apartment,Private room,2,2 shared baths,1.0,2.0,t,t,f,0
46259503,26.0,f,Redbridge,Private room in house,Private room,2,1.5 shared baths,1.0,1.0,t,t,t,0
46259530,59.0,f,Hammersmith and Fulham,Private room in apartment,Private room,2,1 private bath,1.0,NaN,f,t,t,0
46261520,44.0,f,Haringey,Private room in apartment,Private room,1,NaN,1.0,1.0,t,t,t,0

In [7]:
#make host_is_superhost a integer and make any nulls equal to zero(non-superhost)
df_clean['host_is_superhost'] = (df_clean['host_is_superhost'] == 't').astype(int)
df_clean['host_is_superhost'] = df_clean['host_is_superhost'].fillna(0)
df_clean[['host_is_superhost']]

          host_is_superhost
id
11551                     0
13913                     0
15400                     0
17402                     1
17506                     0
...                     ...
46259322                  1
46259459                  0
46259503                  0
46259530                  0
46261520                  0

[76984 rows x 1 columns]

In [8]:
#change neighborhood data from categorical to numerical
clean_neighbourhoods = {"Barking and Dagenham": 1,
                        "Barnet": 2,
                        "Bexley": 3,
                        "Brent": 4,
                        "Bromley": 5,
                        "Camden": 6,
                        "City of London": 7,
                        "Croydon": 8,
                        "Ealing": 9,
                        "Enfield": 10,
                        "Greenwich": 11,
                        "Hackney": 12,
                        "Hammersmith and Fulham": 13,
                        "Haringey": 14,
                        "Harrow": 15,
                        "Havering": 16,
                        "Hillingdon": 17,
                        "Hounslow": 18,
                        "Islington": 19,
                        "Kensington and Chelsea": 20,
                        "Kingston upon Thames": 21,
                        "Lambeth": 22,
                        "Lewisham": 23,
                        "Merton": 24,
                        "Newham": 25,
                        "Redbridge": 26,
                        "Richmond upon Thames": 27,
                        "Southwark": 28,
                        "Sutton": 29,
                        "Tower Hamlets": 30,
                        "Waltham Forest": 31,
                        "Wandsworth": 32,
                        "Westminster": 33}
df_clean['neighbourhood_cleansed'] = df_clean['neighbourhood_cleansed'].replace(clean_neighbourhoods)
df_clean[['neighbourhood_cleansed']]

          neighbourhood_cleansed
id
11551                         22
13913                         19
15400                         20
17402                         33
17506                         13
...                          ...
46259322                      33
46259459                      33
46259503                      26
46259530                      13
46261520                      14

[76984 rows x 1 columns]

In [9]:
#change property_type data from categorical to numerical
df_clean[['property_type']]
df_clean['property_type'].nunique()
df_clean['property_type'].unique()
clean_property_type = {"Entire apartment": 1,
                       "Private room in apartment": 2,
                       "Private room in bed and breakfast": 3,
                       "Private room in house": 4,
                       "Entire townhouse": 5,
                       "Private room in townhouse": 6,
                       "Entire condominium": 7,
                       "Entire serviced apartment": 8,
                       "Room in aparthotel": 9,
                       "Room in serviced apartment": 10, 
                       "Entire house": 11,
                       "Private room in loft": 12,
                       "Private room": 13,
                       "Shared room in apartment": 14,
                       "Tiny house": 15, 
                       "Entire guest suite": 16,
                       "Private room in condominium": 17,
                       "Entire loft": 18,
                       "Houseboat": 19,
                       "Private room in bungalow": 20,
                       "Private room in cottage": 21,
                       "Entire guesthouse": 22, 
                       "Private room in guesthouse": 23,
                       "Shared room in house": 24,
                       "Entire cabin": 25,
                       "Room in bed and breakfast": 26,
                       "Private room in yurt": 27, 
                       "Private room in serviced apartment": 28, 
                       "Boat": 29, 
                       "Private room in guest suite": 30,
                       "Entire cottage": 31, 
                       "Private room in parking space": 32, 
                       "Entire place": 33,
                       "Private room in villa": 34, 
                       "Private room in boat": 35, 
                       "Shared room in loft": 36,
                       "Entire bungalow": 37,
                       "Camper/RV": 38,
                       "Yurt": 39, 
                       "Shared room in bed and breakfast": 40, 
                       "Shared room": 41, 
                       "Shared room in condominium": 42, 
                       "Room in boutique hotel": 43, 
                       "Shared room in guest suite": 44, 
                       "Shared room in hostel": 45, 
                       "Entire home/apt": 46,
                       "Private room in hut": 47,
                       "Entire villa": 48,
                       "Private room in chalet": 49,
                       "Shared room in bungalow": 50,
                       "Private room in camper/rv": 51,
                       "Shared room in townhouse": 52,
                       "Private room in tiny house": 53, 
                       "Private room in cabin": 54,
                       "Entire floor": 55, 
                       "Entire chalet": 56,
                       "Earth house": 57,
                       "Room in hostel": 58,
                       "Private room in hostel": 59,
                       "Shared room in serviced apartment": 60, 
                       "Private room in floor": 61,
                       "Private room in lighthouse": 62,
                       "Barn": 63,
                       "Shared room in villa": 64,
                       "Room in hotel": 65, 
                       "Private room in island": 66, 
                       "Private room in earth house": 67,
                       "Private room in treehouse": 68,
                       "Shared room in farm stay": 69,
                       "Shared room in bus": 70,
                       "Shared room in guesthouse": 71,
                       "Private room in houseboat": 72, 
                       "Castle": 73,
                       "Campsite": 74, 
                       "Private room in farm stay": 75, 
                       "Private room in casa particular": 76,
                       "Shared room in hotel": 77,
                       "Room in apartment": 78,
                       "Private room in dome house": 79,
                       "Casa particular": 80,
                       "Shared room in boutique hotel": 81,
                       "Hut": 82,
                       "Private room in tent": 83,
                       "Room in minsu": 84,
                       "Island": 85,
                       "Private room in bus": 86,
                       "Shared room in earth house": 87,
                       "Private room in shepherd's hut": 88,
                       "Shared room in tent": 89,
                       "Private room in castle": 90,
                       "Lighthouse": 91,
                       "Dome house":92}
df_clean['property_type'] = df_clean['property_type'].replace(clean_property_type)
df_clean[['property_type']]

          property_type
id
11551                 1
13913                 2
15400                 1
17402                 1
17506                 3
...                 ...
46259322              1
46259459              2
46259503              4
46259530              2
46261520              2

[76984 rows x 1 columns]

In [10]:
#change room_type data from categorical to numerical
df_clean['room_type'].nunique()
df_clean['room_type'].unique()
clean_room_type = {"Entire home/apt": 1,
                   "Private room": 2,
                   "Hotel room": 3,
                   "Shared room": 4}
df_clean['room_type'] = df_clean['room_type'].replace(clean_room_type)
df_clean[['room_type']]

          room_type
id
11551             1
13913             2
15400             1
17402             1
17506             2
...             ...
46259322          1
46259459          2
46259503          2
46259530          2
46261520          2

[76984 rows x 1 columns]

In [11]:
#remove null values from bathrooms_text column and change from categorical to numerical
df_clean['bathrooms_text'].nunique()
df_clean['bathrooms_text'].unique()
df_clean['bathrooms_text'].isnull().sum()
df_clean[df_clean['bathrooms_text'].isnull()]
df_clean['bathrooms_text'].fillna(2, inplace=True)
clean_bathrooms_text = {"1 bath": 1,
                        "1 shared bath": 2,
                        "2 baths": 3,
                        "1 private bath": 4,
                        "1.5 shared baths": 5,
                        "1.5 baths": 6,
                        "0 shared baths": 7,
                        "2.5 shared baths": 8,
                        "Shared half-bath": 9,
                        "4 baths": 10,
                        "3 baths": 11,
                        "0 baths": 12,
                        "3 shared baths": 13,
                        "3.5 baths": 14,
                        "Half-bath": 15,
                        "5 baths": 16,
                        "4.5 baths": 17,
                        "5 shared baths": 18,
                        "3.5 shared baths": 19,
                        "Private half-bath": 20,
                        "7 baths": 21,
                        "4 shared baths": 22,
                        "6 baths": 23,
                        "6 shared baths": 24,
                        "5.5 baths": 25,
                        "10 baths": 26,
                        "8.5 baths": 27,
                        "7 shared baths": 28,
                        "4.5 shared baths": 29,
                        "6.5 baths": 30,
                        "8 shared baths": 31,
                        "17 baths": 32,
                        "11 baths": 33,
                        "7.5 baths": 34,
                        "8 baths": 35,
                        "10.5 baths": 36,
                        "9 baths": 37,
                        "12 baths": 38,
                        "9 shared baths": 39,
                        "35 baths": 40,
                        "2 shared baths": 41,
                        "2.5 baths": 42}
df_clean['bathrooms_text'] = df_clean['bathrooms_text'].replace(clean_bathrooms_text)
df_clean[['bathrooms_text']]

          bathrooms_text
id
11551                  1
13913                  2
15400                  1
17402                  3
17506                  4
...                  ...
46259322               1
46259459              41
46259503               5
46259530               4
46261520               2

[76984 rows x 1 columns]

In [12]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76984 entries, 11551 to 46261520
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   price                   76984 non-null  float64
 1   host_is_superhost       76984 non-null  int64
 2   neighbourhood_cleansed  76984 non-null  int64
 3   property_type           76984 non-null  int64
 4   room_type               76984 non-null  int64
 5   accommodates            76984 non-null  int64
 6   bathrooms_text          76984 non-null  int64
 7   bedrooms                72238 non-null  float64
 8   beds                    75904 non-null  float64
 9   instant_bookable        76984 non-null  object
 10  host_has_profile_pic    76973 non-null  object
 11  host_identity_verified  76973 non-null  object
 12  number_of_reviews       76984 non-null  int64
dtypes: float64(3), int64(7), object(3)
memory usage: 8.2+ MB

In [13]:
# remove_rows = df_clean.dropna(subset=['bedrooms', 'beds'], how='all')
# df_clean[['bedrooms', 'beds']].isnull().sum()
# show_rows = df_clean[['bedrooms'].isnull()] & df_clean[['beds'].isnull()]
# show_rows

In [14]:
df_clean.dropna(subset=['bedrooms','beds'], how='all', inplace=True) #drop columns where bedrooms and beds both are null
#df_clean['bedrooms'].unique()
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76882 entries, 11551 to 46261520
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   price                   76882 non-null  float64
 1   host_is_superhost       76882 non-null  int64
 2   neighbourhood_cleansed  76882 non-null  int64
 3   property_type           76882 non-null  int64
 4   room_type               76882 non-null  int64
 5   accommodates            76882 non-null  int64
 6   bathrooms_text          76882 non-null  int64
 7   bedrooms                72238 non-null  float64
 8   beds                    75904 non-null  float64
 9   instant_bookable        76882 non-null  object
 10  host_has_profile_pic    76871 non-null  object
 11  host_identity_verified  76871 non-null  object
 12  number_of_reviews       76882 non-null  int64
dtypes: float64(3), int64(7), object(3)
memory usage: 8.2+ MB

In [15]:
#group by beds and then find mean bedrooms for each number of beds
bedrooms_no_nulls = df_clean[df_clean['bedrooms'].notnull()]
mean_beds_rounded = bedrooms_no_nulls.groupby(by=['beds']).mean().round(0).reset_index()
mean_beds_rounded[['beds', 'bedrooms']]

    beds  bedrooms
0    0.0       1.0
1    1.0       1.0
2    2.0       2.0
3    3.0       2.0
4    4.0       3.0
5    5.0       4.0
6    6.0       4.0
7    7.0       4.0
8    8.0       4.0
9    9.0       5.0
10  10.0       4.0
11  11.0       5.0
12  12.0       3.0
13  13.0       4.0
14  14.0       5.0
15  15.0       4.0
16  16.0       8.0
17  17.0       8.0
18  18.0       7.0
19  19.0       8.0
20  20.0       9.0
21  21.0       1.0
22  24.0       8.0
23  27.0       8.0
24  28.0      10.0
25  50.0      50.0

In [16]:
#make prediction for null values in 'bedrooms' feature based on mean of bedrooms associated with beds column
import numpy as np
fill_dict1 = mean_beds_rounded.set_index('beds')['bedrooms'].to_dict()
df_clean['bedrooms'] = df_clean['bedrooms'].replace(np.nan, df_clean['beds'].map(fill_dict1))
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76882 entries, 11551 to 46261520
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   price                   76882 non-null  float64
 1   host_is_superhost       76882 non-null  int64
 2   neighbourhood_cleansed  76882 non-null  int64
 3   property_type           76882 non-null  int64
 4   room_type               76882 non-null  int64
 5   accommodates            76882 non-null  int64
 6   bathrooms_text          76882 non-null  int64
 7   bedrooms                76882 non-null  float64
 8   beds                    75904 non-null  float64
 9   instant_bookable        76882 non-null  object
 10  host_has_profile_pic    76871 non-null  object
 11  host_identity_verified  76871 non-null  object
 12  number_of_reviews       76882 non-null  int64
dtypes: float64(3), int64(7), object(3)
memory usage: 10.7+ MB

In [17]:
#group by bedrooms and then find mean beds for each number of bedrooms
beds_no_nulls = df_clean[df_clean['beds'].notnull()]
mean_bedrooms_rounded = bedrooms_no_nulls.groupby(by=['bedrooms']).mean().round(0).reset_index()
mean_bedrooms_rounded[['beds', 'bedrooms']]

    beds  bedrooms
0    1.0       1.0
1    2.0       2.0
2    3.0       3.0
3    5.0       4.0
4    6.0       5.0
5    7.0       6.0
6    9.0       7.0
7   13.0       8.0
8    6.0       9.0
9    9.0      10.0
10  11.0      11.0
11  16.0      12.0
12  16.0      16.0
13   1.0      19.0
14   0.0      22.0
15  50.0      50.0

In [18]:
#make prediction for null values in 'beds' feature based on mean of beds associated with bedrooms column
fill_dict2 = mean_beds_rounded.set_index('bedrooms')['beds'].to_dict()
df_clean['beds'] = df_clean['beds'].replace(np.nan, df_clean['bedrooms'].map(fill_dict2))
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76882 entries, 11551 to 46261520
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   price                   76882 non-null  float64
 1   host_is_superhost       76882 non-null  int64
 2   neighbourhood_cleansed  76882 non-null  int64
 3   property_type           76882 non-null  int64
 4   room_type               76882 non-null  int64
 5   accommodates            76882 non-null  int64
 6   bathrooms_text          76882 non-null  int64
 7   bedrooms                76882 non-null  float64
 8   beds                    76881 non-null  float64
 9   instant_bookable        76882 non-null  object
 10  host_has_profile_pic    76871 non-null  object
 11  host_identity_verified  76871 non-null  object
 12  number_of_reviews       76882 non-null  int64
dtypes: float64(3), int64(7), object(3)
memory usage: 10.7+ MB

In [19]:
#change instant_bookable from categorical data to numerical 
df_clean['instant_bookable'] = (df_clean['instant_bookable'] == 't').astype(int)
df_clean.head()

,price,host_is_superhost,neighbourhood_cleansed,property_type,room_type,accommodates,bathrooms_text,bedrooms,beds,instant_bookable,host_has_profile_pic,host_identity_verified,number_of_reviews
id,,,,,,,,,,,,,
11551,97.0,0,22,1,1,4,1,1.0,3.0,1,t,t,192
13913,40.0,0,19,2,2,2,2,1.0,0.0,0,t,t,21
15400,75.0,0,20,1,1,2,1,1.0,1.0,1,t,t,89
17402,307.0,1,33,1,1,6,3,3.0,3.0,0,t,t,42
17506,150.0,0,13,3,2,2,4,1.0,1.0,0,t,t,0

In [20]:
#change host_has_profile_pic from categorical data to numerical and fill missing values with 0 (no profile pic)
df_clean['host_has_profile_pic'] = (df_clean['host_has_profile_pic'] == 't').astype(int)
df_clean['host_has_profile_pic'] = df_clean['host_has_profile_pic'].fillna(0)
df_clean[['host_has_profile_pic']]

          host_has_profile_pic
id
11551                        1
13913                        1
15400                        1
17402                        1
17506                        1
...                        ...
46259322                     1
46259459                     1
46259503                     1
46259530                     1
46261520                     1

[76882 rows x 1 columns]

In [21]:
#change host_identity_verified from categorical data to numerical and fill missing values with 0 (not verified)
df_clean['host_identity_verified'] = (df_clean['host_identity_verified'] == 't').astype(int)
df_clean['host_identity_verified'] = df_clean['host_identity_verified'].fillna(0)
df_clean[['host_identity_verified']]

          host_identity_verified
id
11551                          1
13913                          1
15400                          1
17402                          1
17506                          1
...                          ...
46259322                       1
46259459                       0
46259503                       1
46259530                       1
46261520                       1

[76882 rows x 1 columns]

In [22]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76882 entries, 11551 to 46261520
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   price                   76882 non-null  float64
 1   host_is_superhost       76882 non-null  int64
 2   neighbourhood_cleansed  76882 non-null  int64
 3   property_type           76882 non-null  int64
 4   room_type               76882 non-null  int64
 5   accommodates            76882 non-null  int64
 6   bathrooms_text          76882 non-null  int64
 7   bedrooms                76882 non-null  float64
 8   beds                    76881 non-null  float64
 9   instant_bookable        76882 non-null  int64
 10  host_has_profile_pic    76882 non-null  int64
 11  host_identity_verified  76882 non-null  int64
 12  number_of_reviews       76882 non-null  int64
dtypes: float64(3), int64(10)
memory usage: 10.7 MB

In [23]:
is_null = df_clean['beds'].isnull()
row = df_clean[is_null]
row

,price,host_is_superhost,neighbourhood_cleansed,property_type,room_type,accommodates,bathrooms_text,bedrooms,beds,instant_bookable,host_has_profile_pic,host_identity_verified,number_of_reviews
id,,,,,,,,,,,,,
41872807,240.0,0,30,1,1,16,6,6.0,NaN,0,1,1,0

In [26]:
df_clean['beds'].fillna(7, inplace=True)

In [27]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76882 entries, 11551 to 46261520
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   price                   76882 non-null  float64
 1   host_is_superhost       76882 non-null  int64
 2   neighbourhood_cleansed  76882 non-null  int64
 3   property_type           76882 non-null  int64
 4   room_type               76882 non-null  int64
 5   accommodates            76882 non-null  int64
 6   bathrooms_text          76882 non-null  int64
 7   bedrooms                76882 non-null  float64
 8   beds                    76882 non-null  float64
 9   instant_bookable        76882 non-null  int64
 10  host_has_profile_pic    76882 non-null  int64
 11  host_identity_verified  76882 non-null  int64
 12  number_of_reviews       76882 non-null  int64
dtypes: float64(3), int64(10)
memory usage: 10.7 MB